doc/TideTools.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Tide Tools </title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Tide Tools "/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-09-03T11:39-0400"/>
<meta name="author" content="Capt. Ben Smith"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Tide Tools </h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Overview</a></li>
<li><a href="#sec-2">2 The Process Flow</a></li>
<li><a href="#sec-3">3 The Tools</a>
<ul>
<li><a href="#sec-3-1">3.1 Tide Conversion</a></li>
<li><a href="#sec-3-2">3.2 Tide Plotter</a></li>
<li><a href="#sec-3-3">3.3 Tide Trimmer</a></li>
<li><a href="#sec-3-4">3.4 Tide Smoother</a></li>
<li><a href="#sec-3-5">3.5 Tide Resampler</a></li>
<li><a href="#sec-3-6">3.6 Tide Peaks</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">

<p>The CCOM Tide Tools is a collection of utilities for processing the data that is recorded by our tide guages. The tools are scripts written in Python. They can easily be converted to Perl and Matlab.
</p>
<p>
The design is for a data flow, from raw data captured at the tide station to input suitable for Caris and tide predictions based both on range and offset from a primary station, and tidal constituents derived from the data.
</p>
<p>
The diagram on the right shows how the data flows.
</p>
<p>
The Tide Tools are not yet complete. You are welcome to contribute to the project.
</p>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> The Process Flow</h2>
<div class="outline-text-2" id="text-2">


<p>
    A typical flow of data through these tools would be:
</p>
<ol>
<li>tideConvert - to generate water level in a standard format from recorded data
</li>
<li>tidePlot - to visually check the result and see any significant data gaps
</li>
<li>tideTrim - to remove outliers
</li>
<li>tidePlot - to visually check the result of the tideTrim
</li>
<li>tideResample - fill in gaps before smoothing (or down sample)
</li>
<li>tidePlot - check again
</li>
<li>tideFilter - low pass filter for smoothing
</li>
<li>tidePeaks - analysis for offsets and scale
</li>
<li>tidePlot - inspect the results against any of the previous steps 
</li>
</ol>



</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> The Tools</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Tide Conversion</h3>
<div class="outline-text-3" id="text-3-1">


<p>
   The tideConvert serves one purpose: convert the raw water pressure data and time to water depth and formatted time
</p></div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Tide Plotter</h3>
<div class="outline-text-3" id="text-3-2">


<p>
    The tidePlot can be used to visualize the data at any stage. It can compare tidal data that shares the same time base. This is particularly important when checking the results of interpolation or filtering.
</p></div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Tide Trimmer</h3>
<div class="outline-text-3" id="text-3-3">


<p>
    The tideTrim program serves two purposes:
</p>
<ol>
<li>limit the data set to specified time span (bandpass on the Time axis)
</li>
<li>delete outliers (statistical bandpass on the depth values) 
</li>
</ol>


</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Tide Smoother</h3>
<div class="outline-text-3" id="text-3-4">


<p>
    The tideFilter is is a lowpass filter. It is used to smooth the steps and ripples of raw data so that peaks can be more easily found.
</p>
</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Tide Resampler</h3>
<div class="outline-text-3" id="text-3-5">


<p>
    tideResample uses least squares linear regression and interpolation to reposition the sample times.
</p></div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Tide Peaks</h3>
<div class="outline-text-3" id="text-3-6">


<p>
    The tidePeaks program selects the time and tidal heights of the maximums and minimums from a set of clean, continuous data. This is particularly valuable in determining tidal offsets.
</p>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-09-03T11:39-0400</p>
<p class="author">Author: Capt. Ben Smith</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
